Repository: 84000/data-translation-memory
Catalog: toh190-v3.tmx
Source language: bo
Languages: en

source: ཆེ་ཞེ་གལ་ཏེ་ཁྱོད་ཐེག་པ་ཆེན་པོ་གང་ལ་ཡང་མི་གནས་ལ་ལྡོག་པ་ཡང་མེད་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་གང་དག་ཡིན་པ་དེ་དག་ཅི་ལ་ཞུགས། སྨྲས་པ།
en: “Elder sister, if you do not abide anywhere at all within the Great Vehicle, and if, moreover, there is nothing to withdraw from, then what do those who enter into the Great Vehicle enter into?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཐེག་པ་ཆེན་པོ་པ་རྣམས་ནི་ཅི་ལ་ཡང་མི་གནས་ཏེ།
en: “Honorable Śāriputra, followers of the Great Vehicle do not abide anywhere at all.

source: མ་རིག་པ་ཟད་པར་བགྱི་བའི་སླད་དུ་དེ་དག་མི་གནས་པ་ནས་རྒ་ཤིའི་བར་དུ་ཟད་པར་བགྱི་བའི་སླད་དུ་དེ་དག་མི་གནས་སོ།
en: They do not abide in order to bring about the exhaustion of ignorance up through old age and death.

source: བཙུན་པ་ཤཱ་རིའི་བུ་མ་རིག་པ་ནས་རྒ་ཤིའི་བར་དུ་མི་ཟད་པའི་སླད་དུའོ།
en: Honorable Śāriputra, it is because ignorance up through old age and death are inexhaustible.

source: །དེས་ན་དེ་དག་ནི་སྐྱེ་བའི་ཆོས་ཅན་ཡང་མ་ལགས། འགག་པའི་ཆོས་ཅན་མ་ལགས་སོ།
en: Therefore, they do not arise, nor do they cease.

source: །གལ་ཏེ་སྐྱེ་བར་གྱུར་ན་ནི་དེ་ལས་ཟད་པར་འགྱུར་ན་གང་གི་ཕྱིར་མི་སྐྱེ་བ་དེའི་ཕྱིར་མི་ཟད་དོ།
en: If they arose, then they would also come to an end. However, since they do not arise, they also do not come to an end.

source: །དེ་བས་ན་ཟད་པ་ཡང་མ་མཆིས། སྐྱེ་བ་ཡང་མ་མཆིས་སོ།
en: Consequently, they are inexhaustible and unborn.

source: །དགེ་སྦྱོང་གི་ཆོས་ནི་མི་སྐྱེ་བའི་ཆོས་ཅན་ནོ།
en: The Dharma of mendicants is unarisen.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་དེ་ལྟར་ན་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མ་སྐྱེས་པ་དང་མ་འགགས་པ་ལགས་སོ།
en: That being so, honorable Śāriputra, that which is dependently originated is unarisen and unceasing.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བུད་མེད་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཆེ་ཞེ་ཁྱོད་ནི་ལྷར་བཅས་པའི་འཇིག་རྟེན་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་བཅས་པས་ཕྱག་བྱ་བའི་འོས་ཡིན་ན་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ལྟ་ཅི་སྨོས།
en: Venerable Śāriputra said to the lady, “Elder sister, as you are worthy of the homage of the world with its gods, as well as of the hearers and solitary buddhas, what need is there to mention the homage of Venerable Subhūti?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་ཟག་གིས་གང་ཟག་ལ་ཚོད་འཛིན་པ་སུ་ཞིག་མཆིས་ཏེ།
en: Venerable Śāriputra then said to the Blessed One, “Blessed One, is there any person who can appraise others?

source: ཆེ་ཞེ་འདི་ནི་འདི་ལྟར་རྒྱན་གྱིས་ལེགས་པར་བརྒྱན་ལ་འདི་ལྟར་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་ལགས་སོ། །བུད་མེད་དེས་སྨྲས་པ།
en: This elder sister, elegantly adorned with jewelry, speaks with perfect eloquence.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་འདི་ནི་རྒྱན་གྱི་སྤོབས་པ་མ་ལགས་སོ། །སྨྲས་པ།
en: “Honorable Śāriputra,” replied the lady, “I am not confident because of my jewelry.”

source: འོ་ན་གང་གི་སྤོབས་པ་ཡིན།
en: “Well then, what kind of confidence do you have?”

source: སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་བརྒྱད་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱན་ལགས་ཏེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Honorable Śāriputra, there are eight ornaments of bodhisattvas, which are as follows: the ornament of not forgetting the mind of awakening; the ornament of maintaining the good motivation of great compassion; the ornament of being without animosity toward any sentient being;

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་རྒྱན་དང་། སྙིང་རྗེ་ཆེན་པོའི་ལྷག་པའི་བསམ་པ་ལ་གནས་པའི་རྒྱན་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་ཀྱི་རྒྱན་དང་། ཐོས་པའི་ཆོས་ཡོངས་སུ་འཚོལ་བ་ལ་ཆོག་མི་ཤེས་པའི་རྒྱན་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་དང་ཇི་ལྟར་ཀུན་ཆུབ་པར་བྱས་པ་རྣམས་ལ་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་ཅིང་དཔྱོད་པའི་རྒྱན་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་ཀྱང་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་རྒྱན་དང་། ཆོས་ཟབ་མོ་རྣམ་པར་ངེས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། སེམས་ཅན་གྱི་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་རྒྱན་དང་། རྒྱན་དེ་ཡང་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་དང་། ཐབས་ལ་མཁས་པའི་རྒྱན་ཏེ།
en: the ornament of being insatiable when it comes to seeking out Dharma teachings; the ornament of proper investigation and analysis of the Dharma teachings that one has heard and mastered; the ornament of bringing beings to full maturity without observing any phenomenon; the ornament of wisdom that ascertains the profound Dharma and knows dependent origination, as well as the various faculties of beings; and the ornament of the Buddha’s blessing and skill in means.

source: བཙུན་པ་ཤཱ་རིའི་བུ་བརྒྱད་པོ་དེ་དག་ནི་རྒྱན་དག་ལགས་ཏེ།
en: Honorable Śāriputra, these are the eight ornaments.

source: རྒྱན་དེ་དག་གིས་བརྒྱན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐོགས་པ་མེད་པའི་སྤོབས་པ་དང་ལྡན་ནོ།
en: A bodhisattva bedecked with these ornaments has unimpeded confidence.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆེ་ཞེ་འདི་གང་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་ལགས།
en: Venerable Śāriputra asked the Blessed One, “Blessed One, where did this elder sister die before she was born here?”

source: དེ་ནས་བུད་མེད་དེས་བདག་ཉིད་ཀྱི་ལུས་ཅི་འདྲ་བ་དེ་ཁོ་ན་འདྲ་བའི་བུད་མེད་དག་གཅིག་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་མདུན་དུ་སྤྲུལ་ཏོ། །སྤྲུལ་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་བུད་མེད་འདི་ལ་ག་ལས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་ཞེས་དྲིས་ཤིག །གནས་བརྟན་ཤཱ་རིའི་བུས་སྨྲས་པ།
en: At this point the lady emanated a woman with a body exactly like her own in front of Venerable Śāriputra and told him, “Ask this lady, honorable Śāriputra, where she died before she was born here.”

source: བུད་མེད་འདི་ནི་སྤྲུལ་པ་ཡིན་ཏེ།
en: “This lady is an emanation,” replied elder Śāriputra.

source: སྤྲུལ་པ་ལ་ནི་འཆི་འཕོ་དང་སྐྱེ་བ་མེད་དོ། །སྨྲས་པ།
en: “Emanations do not die, nor are they born.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཐམས་ཅད་སྤྲུལ་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: “Similarly, honorable Śāriputra, the Thus-Gone One has fully awakened to the fact that all phenomena are essentially emanations.

source: །ཆོས་ཐམས་ཅད་སྤྲུལ་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ལ་ནི་འཆི་འཕོའམ་སྐྱེ་བ་འདྲི་བར་མི་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: Do not ask questions about the death and birth of those who understand all phenomena to be essentially emanations.”

source: ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བུད་མེད་འགྱུར་བ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: “Śāriputra,” said the Blessed One, “this is the bodhisattva great being Strīvivarta.

source: དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མངོན་པར་དགའ་བ་ནས་ཤི་འཕོས་ནས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདིར་འོངས་སོ།
en: After she died in Manifest Joy, the buddha realm of the Thus-Gone One Akṣobhya, she came here to bring beings to full maturity.

source: །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་འགྱུར་བ་འདིས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: Śāriputra, in this Sahā world system the bodhisattva Strīvivarta has ripened countless, innumerable beings into unsurpassed and perfect awakening.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་འགྱུར་བས་བུད་མེད་ཀྱི་གཟུགས་ཉིད་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་པའི་བར་དང་། བདག་གི་བུད་མེད་ཀྱི་ལུས་མ་མཆིས་པར་གྱུར་ཏེ། སྐྱེས་པའི་ལུས་སུ་མ་གྱུར་གྱི་བར་དུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལས་མི་ལྡང་ལགས་སོ།
en: At this point the bodhisattva Strīvivarta, in her female form, prostrated with her head at the feet of the Blessed One and said, “Until I receive a prophecy regarding my unsurpassed and perfect awakening, and until I no longer have this female body but rather a male body, I will not rise from the Blessed One’s feet.”

source: །བུད་མེད་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་བུད་མེད་ཀྱི་རང་བཞིན་ལས་གྱུར་ཏེ། སྐྱེས་པའི་རང་བཞིན་དུ་མ་གྱུར་གྱི་བར་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་གྱི་བར་དུ་བདག་ཅག་མི་ལྡང་ལགས་སོ།
en: The five hundred women also prostrated with their heads at the feet of the Blessed One and said, “Blessed One, we, too, will not rise until our nature changes from female to male, and until a prophecy is given regarding our unsurpassed and perfect awakening.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་དོ།
en: The Blessed One smiled.

source: །འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ།
en: As happens when blessed buddhas smile, the following occurred:

source: དེ་ནས་དེའི་མོད་ལ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་དུ་མ་སྣ་ཚོགས་འདི་ལྟ་སྟེ།
en: instantly, many different kinds of light rays emerged from the Blessed One’s mouth;

source: སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་སྟེ།
en: they were blue, yellow, red, white, crimson, crystal, and silver-colored.

source: འོད་ཟེར་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ཐུག་སྟེ། ཕྱིར་ལོག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་བོའི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ།
en: The light pervaded boundless and infinite world systems, reaching as far as the Brahmā realm, then returned and disappeared into the crown of the Blessed One’s head.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན།
en: Venerable Ānanda arose from his seat, draped his robe over one shoulder, bowed with joined palms to the Blessed One, and said to him, “Blessed One, the thus-gone ones do not smile without causes and conditions.

source: བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས།
en: That being so, what is the cause of your smile, and what are its conditions?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་འགྱུར་བ་བུད་མེད་ལྔ་བརྒྱས་བསྐོར་བ་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་གཏུགས་པ་མཐོང་ངམ། གསོལ་པ།
en: “Ānanda,” replied the Blessed One, “did you see the bodhisattva Strīvivarta, surrounded by five hundred women, touching the Thus-Gone One’s feet?”

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ།
en: “I did, Blessed One.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་འགྱུར་བ་འདི་བསྐལ་པ་བགྲང་བ་ལས་འདས་པ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: “Ānanda,” continued the Blessed One, “incalculable eons from now, this bodhisattva Strīvivarta will fully awaken to unexcelled and perfect buddhahood.

source: འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་གྱི་རྒྱལ་པོའི་སྤོབས་པ་ཅན་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: In the world she will be known as the thus-gone, worthy, and perfect Buddha Eloquent King of Qualities.

source: དེས་བྱང་ཆུབ་ཐོབ་པ་ན་བུད་མེད་ལྔ་བརྒྱ་པོ་འདི་དག་གཟུངས་ཐོབ་པ་དང་། ཐོགས་པ་མེད་པའི་སྤོབས་པ་དང་ལྡན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བུད་མེད་འགྱུར་བ་འདིས་ཡོན་ཏན་གྱི་རྒྱན་བསྟན་པ་གང་དག་ཡིན་པའི་རྒྱན་བརྒྱད་པོ་དེ་དག་གིས་བརྒྱན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱར་འགྱུར་ཏེ།
en: When she attains awakening, each of these five hundred women will attain retention, possess unimpeded eloquence, and become a bodhisattva adorned with the eight ornaments described by the bodhisattva great being Strīvivarta in her teaching on the ornaments of good qualities.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྤོབས་པ་ཅན་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རོ།
en: The Thus-Gone One Eloquent King of Qualities will prophesy the unsurpassed and perfect awakening of those bodhisattvas.

source: །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྤོབས་པ་ཅན་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་འབྱོར་ཅིང་རྒྱས་ལ། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། མི་དང་། སྐྱེ་བོ་མང་པོས་གང་བར་འགྱུར་ཏེ། དགའ་ལྡན་གྱི་ལྷའི་ལོངས་སྤྱོད་དང་མཉམ་པར་འགྱུར་རོ།
en: Moreover, Ānanda, the buddha realm of the Thus-Gone One Eloquent King of Qualities will be rich and vast, and filled with happiness, good harvests, humans, and many other beings, such that its resources will equal those of the gods in the Heaven of Joy.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བུད་མེད་ནི་མིང་ཙམ་ཡང་མེད་པར་འགྱུར་ཏེ།
en: In that buddha realm, not even the word woman will exist.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་པད་མའི་སྙིང་པོ་ལས་རྫུས་ཏེ་སྐྱེས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ལ་གཙང་ཞིང་ཚངས་པར་སྤྱོད་པ་དང་། རྒྱན་བརྒྱད་པོ་དེ་དག་གིས་བརྒྱན་པར་འགྱུར་རོ།
en: Everyone will take miraculous births from the hearts of lotuses. Seated cross-legged, they will be pure and celibate, and will be adorned with those eight ornaments.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་འགྱུར་བ་དེ་དང་། བུད་མེད་ལྔ་བརྒྱ་པོ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་མངོན་སུམ་དུ་ལུང་བསྟན་པ་ཐོས་ནས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དེ་ཁོ་ནས་ཏ་ལ་བདུན་སྲིད་ཙམ་གྱི་ནམ་མཁའ་ལ་འཕགས་ནས།
en: As they heard the Blessed One’s clear prophesy, the bodhisattva Strīvivarta and the five hundred women, totally delighted and overjoyed, rose up into the sky to the height of seven palm trees.

source: དེའི་མོད་ཁོ་ན་ལ་ཁྱེའུ་ལོ་བཅུ་དྲུག་ལོན་པ་ཙམ་དུ་སྣང་བར་གྱུར་ཏོ།
en: As soon as that happened, they all took on the appearance of sixteen-year-old boys.

source: །དེ་དག་བར་སྣང་དེ་ལས་བབས་ཏེ་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། དེ་བཞིན་གཤེགས་པས་དེ་དག་ཐམས་ཅད་ཀྱི་སྤྱི་བོར་ཕྱག་གིས་བྱུགས་སོ།
en: Descending from the sky, they prostrated to the Blessed One, and the Thus-Gone One placed his hand on the crowns of their heads.

source: །དེ་ནས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེའི་ཚེ་གཟུངས་དང་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ།
en: Immediately, they all attained retention and the absorption called complete illumination

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ལ་གཞན་དག་ལ་ཡང་རྒྱས་པར་ཡང་དག་པར་སྟོན་ཅིག །གསོལ་པ།
en: The Blessed One said to venerable Ānanda, “Remember this Dharma teaching, Ānanda, and teach it correctly and extensively to others.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Blessed One, what is the name of this Dharma teaching? How should it be known?”

source: ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁྱོད་ཀྱིས་སྤོབས་པ་བཀོད་པའི་རྒྱན་ཅེས་བྱ་བར་ཟུང་ཤིག །བུད་མེད་འགྱུར་བ་ལུང་བསྟན་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: “Ānanda,” spoke the Blessed One, “you should remember this Dharma teaching as The Ornament That Brings About Eloquence . You can also remember it as The Prophecy Concerning Strīvivarta

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བུད་མེད་འགྱུར་བ་འཁོར་དང་བཅས་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷ་དང་། ཀླུ་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: When the Blessed One had said this, the bodhisattva great being Strīvivarta together with her retinue, venerable Ānanda and the great hearers, the bodhisattvas, and the world with its gods, nāgas, asuras, and gandharvas rejoiced and praised what the Blessed One had said.

source: །།འཕགས་པ་བུད་མེད་འགྱུར་བ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This completes the noble Great Vehicle sūtra “The Prophecy Concerning Strīvivarta.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་པྲཛྙཱ་བརྨ་དང་། ཤཱི་ལེནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སྩོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། ཤླཽ་ཀ་དྲུག་བརྒྱ། བམ་པོ་གཉིས་པའོ།།
en: This was translated, proofed, and finalized by the Indian preceptors Prajñāvarman and Śīlendrabodhi, together with the translator-editor Bandé Yeshé Dé and others.
